#              Обзор сторонних библиотек Python
####################################################
# БИБЛИОТЕКА numpy (работа с векторами и матрицами):

import numpy as np

# Вектор (или массив) в numpy -
# это упорядоченный набор однородных данных

V0 = np.zeros(4)
V1 = np.arange(4)
V2 = np.fromstring('10, 20, 30, 40', dtype=int, sep=', ')

V_log = np.array((True, False, True, False))

# Векторные (поэлементные) операции с массивами:
print('*********************************************************\n numpy:\n*********************************************************')
print('ИСХОДНЫЕ МАССИВЫ:')

print(f'np.zeros(4): \t\t{V0 = }')
print(f'np.arange(4):\t\t{V1 = }')
print(f'np.fromstring(...):\t{V2 = }')
print(f'np.array(...):\t\t{V_log = }')

print('\nОПЕРАЦИИ:')

print(f'{V1 + V2 = }')
print(f'{V1 * V2 = }')
print(f'{V1== V0 = }')

# Выбор элементов массива по логическому массиву
print(f'{V1[V_log] = }')

####################################################
# БИБЛИОТЕКА pandas (работа с массивами данных, таблицами):

import pandas as pd
print('*********************************************************\n pandas:\n*********************************************************')
# print(pd.__version__)
df = pd.read_csv('Houses_for_Pandas.csv', index_col=0)
print('Таблица характеристик жилых домов УК "Ромашка"\n--------------------------------------------------')
print(df)

######### Группировка
print('\nКоличество домов в разрезе материала стен и кровли\n--------------------------------------------------')
print(df.groupby(['Материал крыши', 'Материал стен'])['Площадь жилая'].count())

######### Сводная таблица
pvt = df.pivot_table(columns=['Год постройки'], index=['Материал стен'], values='Площадь жилая', aggfunc='sum')

years = list(map(int, pvt))
# print(f'{years}')
print('\nПлощади кирпичных домов по годам постройки\n--------------------------------------------------')

print(pvt.loc['кирпич', years[:years.index(1970)]])

print('*********************************************************\n matplotlib:'
      '  см. файл MatPlotLib_star.py\n*********************************************************')

import MatPlotLib_star


